PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_uart.c
    periph = uart->periph;
    if((USART0 == periph) || (USART1 == periph)) {
        /* deinitialize the periph and the device information sturcture */
        hals_uart_deinit(periph);
        hal_uart_struct_init(HAL_UART_DEV_STRUCT, uart);
        uart->periph = periph;
    } else {
        HAL_DEBUGE("parameter [uart->periph] value is invalid");
    }
}

/*!
    \brief      initialize uart
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  periph: specify which UART is initialized
    \param[in]  p_init: the initialization data needed to initialize uart
                  work_mode: UART_WORK_MODE_ASYN, UART_WORK_MODE_SINGLE_WIRE, UART_WORK_MODE_MULTIPROCESSCOR
                             UART_WORK_MODE_LIN
                  baudrate: communication baudrate
                  parity: UART_PARITY_NONE, UART_PARITY_EVEN, UART_PARITY_ODD
                  word_length: UART_WORD_LENGTH_8BIT, UART_WORD_LENGTH_9BIT
                  stop_bit: UART_STOP_BIT_1, UART_STOP_BIT_0_5, UART_STOP_BIT_2, UART_STOP_BIT_1_5
                  over_sample: UART_OVER_SAMPLE_8, UART_OVER_SAMPLE_16
                  sample_method: UART_THREE_SAMPLE_BIT, UART_ONE_SAMPLE_BIT
                  direction: UART_DIRECTION_RX_TX, UART_DIRECTION_RX_ONLY, UART_DIRECTION_TX_ONLY
                  hardware_flow: UART_HARDWARE_FLOW_NONE, UART_HARDWARE_FLOW_RTS_ONLY, UART_HARDWARE_FLOW_CTS_ONLY
                                UART_HARDWARE_FLOW_RTS_CTS
                  rx_fifo_en：DISABLE, ENABLE
                  timeout_enable: DISABLE, ENABLE
                  timeout_value: 0 - (2^24-1)
                  first_bit_msb: DISABLE, ENABLE
                  tx_rx_swap: DISABLE, ENABLE
                  rx_level_invert: DISABLE, ENABLE
                  tx_level_invert: DISABLE, ENABLE
                  data_bit_invert: DISABLE, ENABLE
                  overrun_disable: DISABLE, ENABLE
                  rx_error_dma_stop: DISABLE, ENABLE
                  lin_mode: (USART0 only)
                    break_frame_length: UART_LIN_BREAK_DETECTION_10BIT, UART_LIN_BREAK_DETECTION_11BIT
                  rs485_mode:
                    rs485_mode: DISABLE, ENABLE
                    de_polarity: UART_RS485_DE_POLARITY_HIGH, UART_RS485_DE_POLARITY_LOW
                    de_assertion_time: 0 - 31
                    de_deassertion_time: 0 - 31
                  multiprocessor_mode:
                    wakeup_mode: UART_MULTIPROCESSOR_WAKEUP_IDLE, UART_MULTIPROCESSOR_WAKEUP_ADDRESS
                    address: 0 - 15(4-bit address detection), 0 - 255(full-bit address detection)
                    addr_length: UART_MULTIPROCESSOR_ADDRESS_4BIT, UART_MULTIPROCESSOR_ADDRESS_FULLBIT
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL details refer to gd32f3x0_hal.h
*/
int32_t hal_uart_init(hal_uart_dev_struct *uart, uint32_t periph, hal_uart_init_struct *p_init)
{
    uint32_t reg_temp;

#if (1 == HAL_PARAMETER_CHECK)
    /* check uart pointer and p_init address */
    if((NULL == uart) || (NULL == p_init)) {
        HAL_DEBUGE("pointer [uart] or [p_init] address is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check periph parameter */
    if((USART0 != periph) && (USART1 != periph)) {
        HAL_DEBUGE("parameter [periph] value is invalid");
        return HAL_ERR_VAL;
    }

    /* check periph value from uart device struct */
    if(0 != uart->periph) {
        HAL_DEBUGI("periph value from uart device struct has been rewrite");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock uart */
    HAL_LOCK(uart);

    uart->periph    = periph;

    /* disable uart */
    hals_uart_disable(periph);

    /* configure CTL0 register */
    reg_temp = USART_CTL0(periph);
    reg_temp &= ~(USART_CTL0_PM | USART_CTL0_PCEN | USART_CTL0_WL | USART_CTL0_OVSMOD | USART_CTL0_REN | USART_CTL0_TEN);
    reg_temp |= (p_init->direction | p_init->over_sample | p_init->parity | p_init->word_length);
    USART_CTL0(periph) = reg_temp;

    /* configure CTL1 register */
    reg_temp = USART_CTL1(periph);
    reg_temp &= ~(USART_CTL1_STB);
    reg_temp |= (p_init->stop_bit);
    USART_CTL1(periph) = reg_temp;

    /* configure timeout enable */
    if(ENABLE == p_init->timeout_enable) {
        USART_CTL1(periph) |= USART_CTL1_RTEN;
    } else {
        USART_CTL1(periph) &= ~(USART_CTL1_RTEN);
    }
    /* configure the data bit invert function */
    if(ENABLE == p_init->data_bit_invert) {
        USART_CTL1(periph) |= USART_CTL1_DINV;
    } else {
        USART_CTL1(periph) &= ~(USART_CTL1_DINV);
    }
    /* configure the rx level invert function */
    if(ENABLE == p_init->rx_level_invert) {
        USART_CTL1(periph) |= USART_CTL1_RINV;
    } else {
        USART_CTL1(periph) &= ~(USART_CTL1_RINV);
    }
    /* configure the tx level invert function */
    if(ENABLE == p_init->tx_level_invert) {
        USART_CTL1(periph) |= USART_CTL1_TINV;
    } else {
        USART_CTL1(periph) &= ~(USART_CTL1_TINV);
    }
    /* configure the tx rx swap function */
    if(ENABLE == p_init->tx_rx_swap) {
        USART_CTL1(periph) |= USART_CTL1_STRP;
    } else {
        USART_CTL1(periph) &= ~(USART_CTL1_STRP);
    }
    /* configure the first bit MSB function */
    if(ENABLE == p_init->first_bit_msb) {
        USART_CTL1(periph) |= USART_CTL1_MSBF;
    } else {
        USART_CTL1(periph) &= ~(USART_CTL1_MSBF);
    }

    /* configure CTL2 register */
    reg_temp = USART_CTL2(periph);
    reg_temp &= ~(USART_CTL2_CTSEN | USART_CTL2_RTSEN | USART_CTL2_OSB);
    reg_temp |= (p_init->hardware_flow | p_init->sample_method);
    USART_CTL2(periph) = reg_temp;
    /* configure the overrun function */
    if(ENABLE == p_init->overrun_disable) {
        USART_CTL2(periph) |= USART_CTL2_OVRD;
    } else {
        USART_CTL2(periph) &= ~(USART_CTL2_OVRD);
    }
    /* configure the rx error DMA stop function */
    if(ENABLE == p_init->rx_error_dma_stop) {
        USART_CTL2(periph) |= USART_CTL2_DDRE;
    } else {
        USART_CTL2(periph) &= ~(USART_CTL2_DDRE);
    }

    /* configure RT register */
    reg_temp = USART_RT(periph);
    reg_temp &= ~USART_RT_RT;
    if(ENABLE == p_init->timeout_enable) {
        reg_temp |= p_init->timeout_value;
    }
    USART_RT(periph) = reg_temp;

    /* configure RFCS register */
    if(ENABLE == p_init->rx_fifo_en) {
        USART_RFCS(periph) |= USART_RFCS_RFEN;
    } else {
        USART_RFCS(periph) &= ~USART_RFCS_RFEN;
    }

    /* configure baudrate */
    hals_uart_baudrate_set(periph, p_init->baudrate);

