PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_uart.c
    /* get the data bit mask */
    uart->data_bit_mask = _uart_data_bit_mask_get(uart);

    /* disable the SMARTCARD mode, Half-Duplex mode, IRDA mode, LIN mode and clock */
    hals_smartcard_mode_disable(periph);
    hals_uart_halfduplex_disable(periph);
    hals_irda_mode_disable(periph);
    hals_usrt_clock_disable(periph);
    hals_uart_lin_mode_disable(periph);

    if(UART_WORK_MODE_ASYN != p_init->work_mode) {
        switch(p_init->work_mode) {
        case UART_WORK_MODE_MULTIPROCESSCOR:
            /* multiprocessor mode configure */
            hals_uart_mute_mode_wakeup_config(periph, p_init->wakeup_mode);
            if(UART_MULTIPROCESSOR_WAKEUP_IDLE != p_init->wakeup_mode) {
                hals_uart_address_detection_mode_config(periph, p_init->addr_length);
                hals_uart_address_config(periph, p_init->address);
            }
            /* enable mute mode */
            hals_uart_mute_mode_enable(periph);
            break;
        case UART_WORK_MODE_LIN:
            /* LIN mode configure */
            hals_uart_lin_break_detection_length_config(periph, p_init->break_frame_length);
            hals_uart_lin_mode_enable(periph);
            break;

        case UART_WORK_MODE_SINGLE_WIRE:
            /* enable single wire(half-duplex) mode */
            hals_uart_halfduplex_enable(periph);
            break;
        default:
            break;
        }
    }

    if(ENABLE == p_init->rs485_mode) {
        p_init->de_assertion_time &= BITS(0, 4);
        p_init->de_deassertion_time &= BITS(0, 4);

        /* RS485 mode configure */
        hals_uart_driver_assertime_config(periph, p_init->de_assertion_time);
        hals_uart_driver_deassertime_config(periph, p_init->de_deassertion_time);
        hals_uart_depolarity_config(periph, p_init->de_polarity);
        /* enable RS485 driver */
        hals_uart_rs485_driver_enable(periph);
    }

    /* reset the Rx and Tx state */
    uart->tx_state = UART_STATE_FREE;
    uart->rx_state = UART_STATE_FREE;

    /* enable usart */
    hals_uart_enable(uart->periph);

    /* unlock uart */
    HAL_UNLOCK(uart);

    return HAL_ERR_NONE;
}

/*!
    \brief      uart interrupt handler content function,which is merely used in uart_handler
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_uart_irq(hal_uart_dev_struct *uart)
{
    if(RESET == _uart_error_flag_get(uart)) {
        /* check whether UART is in receiver mode or not */
        if(RESET != hals_uart_interrupt_flag_get(uart->periph, USART_INT_FLAG_RBNE)) {
            if(NULL != uart->uart_irq.receive_complete_handle) {
                uart->uart_irq.receive_complete_handle(uart);
            }
            return;
        }
        /* check whether UART is in receiver timeout or not */
        if(RESET != hals_uart_interrupt_flag_get(uart->periph, USART_INT_FLAG_RT)) {
            hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_RT);
            if(NULL != uart->uart_irq.receive_timeout_handle) {
                uart->uart_irq.receive_timeout_handle(uart);
            }
            return;
        }
    } else {
        /* check whether the PERR flag is set or not */
        if(RESET != hals_uart_interrupt_flag_get(uart->periph, USART_INT_FLAG_PERR)) {
            hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_PERR);
            uart->error_state |= HAL_UART_ERROR_PERR;
            uart->last_error = HAL_UART_ERROR_PERR;
        }

        /* check whether the NERR flag is set or not */
        if(RESET != hals_uart_interrupt_flag_get(uart->periph, USART_INT_FLAG_ERR_NERR)) {
            hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_NERR);
            uart->error_state |= HAL_UART_ERROR_NERR;
            uart->last_error = HAL_UART_ERROR_NERR;
        }

        /* check whether the FERR flag is set or not */
        if(RESET != hals_uart_interrupt_flag_get(uart->periph, USART_INT_FLAG_ERR_FERR)) {
            hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_FERR);
            uart->error_state |= HAL_UART_ERROR_FERR;
            uart->last_error = HAL_UART_ERROR_FERR;
        }

        /* check whether the ERR ORERR is set or not */
        if(RESET != hals_uart_interrupt_flag_get(uart->periph, USART_INT_FLAG_ERR_ORERR)) {
            hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_ORERR);
            uart->error_state |= HAL_UART_ERROR_ORERR;
            uart->last_error = HAL_UART_ERROR_ORERR;
        }

        /* check whether RBNE ORERR is set or not */
        if(RESET != hals_uart_interrupt_flag_get(uart->periph, USART_INT_FLAG_RBNE_ORERR)) {
            hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_RBNE_ORERR);
            uart->error_state |= HAL_UART_ERROR_ORERR;
            uart->last_error = HAL_UART_ERROR_ORERR;
        }

        /* check whether error state is none or not */
        if(HAL_UART_ERROR_NONE != uart->error_state) {
            if(uart->uart_irq.error_handle != NULL) {
                uart->uart_irq.error_handle(uart);
                uart->error_state = HAL_UART_ERROR_NONE;
            }
            return;
        }
    }

    /* multi-processor mode interrupt handle */
    if(RESET != hals_uart_interrupt_flag_get(uart->periph, USART_INT_FLAG_IDLE)) {
        hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_IDLE);
        if(NULL != uart->uart_irq.idle_line_detected_handle) {
            uart->uart_irq.idle_line_detected_handle(uart);
        }
    }

    /* address match interrput handle */
    if(RESET != hals_uart_interrupt_flag_get(uart->periph, USART_INT_FLAG_AM)) {
        hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_AM);
        if(NULL != uart->uart_irq.address_match_handle) {
            uart->uart_irq.address_match_handle(uart);
        }
    }

    /* LIN mode interrupt handle */
    if(RESET != hals_uart_interrupt_flag_get(uart->periph, USART_INT_FLAG_LBD)) {
        hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_LBD);
        if(NULL != uart->uart_irq.lin_break_detected_handle) {
            uart->uart_irq.lin_break_detected_handle(uart);
        }
    }

    /* wakeup from deepsleep mode interrupt handle */
    if(RESET != hals_uart_interrupt_flag_get(uart->periph, USART_INT_FLAG_WU)) {
        hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_WU);
        uart->rx_state = UART_STATE_FREE;
        uart->tx_state = UART_STATE_FREE;
        if(NULL != uart->uart_irq.wakeup_handle) {
            uart->uart_irq.wakeup_handle(uart);
        }
    }

