PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_uart.c
    /* hardware flow mode interrupt handle */
    if(RESET != hals_uart_interrupt_flag_get(uart->periph, USART_INT_FLAG_CTS)) {
        hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_CTS);
        if(NULL != uart->uart_irq.cts_change_handle) {
            uart->uart_irq.cts_change_handle(uart);
        }
    }

    /* transmitter buffer empty interrupt handle */
    if(RESET != hals_uart_interrupt_flag_get(uart->periph, USART_INT_FLAG_TBE)) {
        if(NULL != uart->uart_irq.transmit_ready_handle) {
            uart->uart_irq.transmit_ready_handle(uart);
        }
        return;
    }

    /* transmission complete interrupt handle */
    if(RESET != hals_uart_interrupt_flag_get(uart->periph, USART_INT_FLAG_TC)) {
        hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_TC);
        if(NULL != uart->uart_irq.transmit_complete_handle) {
            uart->uart_irq.transmit_complete_handle(uart);
        }
        return;
    }
}

/*!
    \brief      set user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  uart: uart device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to uart interrupt callback functions structure
                  The structure member can be assigned as following parameters:
      \arg        hal_irq_handle_cb function pointer: the function is user-defined,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
      \arg        NULL: The corresponding callback mechanism is out of use, and
                    disable corresponding interrupt
    \param[out] none
    \retval     none
*/
void hal_uart_irq_handle_set(hal_uart_dev_struct *uart, hal_uart_irq_struct *p_irq)
{
    /* set user-defined address match interrupt callback */
    if(NULL != p_irq->address_match_handle) {
        uart->uart_irq.address_match_handle = p_irq->address_match_handle;
        hals_uart_interrupt_enable(uart->periph, USART_INT_AM);
    } else {
        uart->uart_irq.address_match_handle = NULL;
        hals_uart_interrupt_disable(uart->periph, USART_INT_AM);
    }

    /* set user-defined CTS change interrupt callback */
    if(NULL != p_irq->cts_change_handle) {
        uart->uart_irq.cts_change_handle = p_irq->cts_change_handle;
        hals_uart_interrupt_enable(uart->periph, USART_INT_CTS);
    } else {
        uart->uart_irq.cts_change_handle = NULL;
        hals_uart_interrupt_disable(uart->periph, USART_INT_CTS);
    }

    /* set user-defined error interrupt callback */
    if(NULL != p_irq->error_handle) {
        uart->uart_irq.error_handle = p_irq->error_handle;
        hals_uart_interrupt_enable(uart->periph, USART_INT_ERR);
        hals_uart_interrupt_enable(uart->periph, USART_INT_PERR);
    } else {
        uart->uart_irq.error_handle = NULL;
        hals_uart_interrupt_disable(uart->periph, USART_INT_ERR);
        hals_uart_interrupt_disable(uart->periph, USART_INT_PERR);
    }

    /* set user-defined idle line detected interrupt callback */
    if(NULL != p_irq->idle_line_detected_handle) {
        uart->uart_irq.idle_line_detected_handle = p_irq->idle_line_detected_handle;
        hals_uart_interrupt_enable(uart->periph, USART_INT_IDLE);
    } else {
        uart->uart_irq.idle_line_detected_handle = NULL;
        hals_uart_interrupt_disable(uart->periph, USART_INT_IDLE);
    }

    /* set user-defined LIN break detected interrupt callback */
    if(NULL != p_irq->lin_break_detected_handle) {
        uart->uart_irq.lin_break_detected_handle = p_irq->lin_break_detected_handle;
        hals_uart_interrupt_enable(uart->periph, USART_INT_LBD);
    } else {
        uart->uart_irq.lin_break_detected_handle = NULL;
        hals_uart_interrupt_disable(uart->periph, USART_INT_LBD);
    }

    /* set user-defined receive complete interrupt callback */
    if(NULL != p_irq->receive_complete_handle) {
        uart->uart_irq.receive_complete_handle = p_irq->receive_complete_handle;
        hals_uart_interrupt_enable(uart->periph, USART_INT_RBNE);
    } else {
        uart->uart_irq.receive_complete_handle = NULL;
        hals_uart_interrupt_disable(uart->periph, USART_INT_RBNE);
    }

    /* set user-defined receive timeout interrupt callback */
    if(NULL != p_irq->receive_timeout_handle) {
        uart->uart_irq.receive_timeout_handle = p_irq->receive_timeout_handle;
        hals_uart_interrupt_enable(uart->periph, USART_INT_RT);
    } else {
        uart->uart_irq.receive_timeout_handle = NULL;
        hals_uart_interrupt_disable(uart->periph, USART_INT_RT);
    }

    /* set user-defined transmit complete interrupt callback */
    if(NULL != p_irq->transmit_complete_handle) {
        uart->uart_irq.transmit_complete_handle = p_irq->transmit_complete_handle;
        hals_uart_interrupt_enable(uart->periph, USART_INT_TC);
    } else {
        uart->uart_irq.transmit_complete_handle = NULL;
        hals_uart_interrupt_disable(uart->periph, USART_INT_TC);
    }

    /* set user-defined transmit ready interrupt callback */
    if(NULL != p_irq->transmit_ready_handle) {
        uart->uart_irq.transmit_ready_handle = p_irq->transmit_ready_handle;
        hals_uart_interrupt_enable(uart->periph, USART_INT_TBE);
    } else {
        uart->uart_irq.transmit_ready_handle = NULL;
        hals_uart_interrupt_disable(uart->periph, USART_INT_TBE);
    }

    /* set user-defined wakeup interrupt callback */
    if(NULL != p_irq->wakeup_handle) {
        uart->uart_irq.wakeup_handle = p_irq->wakeup_handle;
        hals_uart_interrupt_enable(uart->periph, USART_INT_WU);
    } else {
        uart->uart_irq.wakeup_handle = NULL;
        hals_uart_interrupt_disable(uart->periph, USART_INT_WU);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_uart_irq_handle_all_reset(hal_uart_dev_struct *uart)
{
    /* configure interrupt callback function to NULL */
    uart->uart_irq.address_match_handle         = NULL;
    uart->uart_irq.cts_change_handle            = NULL;
    uart->uart_irq.error_handle                 = NULL;
    uart->uart_irq.idle_line_detected_handle    = NULL;
    uart->uart_irq.lin_break_detected_handle    = NULL;
    uart->uart_irq.receive_complete_handle      = NULL;
    uart->uart_irq.receive_timeout_handle      = NULL;
    uart->uart_irq.transmit_complete_handle     = NULL;
    uart->uart_irq.transmit_ready_handle        = NULL;
    uart->uart_irq.wakeup_handle                = NULL;
}

/*!
    \brief      transmit amounts of data, poll transmit process and completed status
                the function is blocking
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY, HAL_ERR_TIMEOUT details refer to gd32f3x0_hal.h
*/
int32_t hal_uart_transmit_poll(hal_uart_dev_struct *uart, uint8_t *p_buffer, uint32_t length, uint32_t timeout_ms)
{
    uint8_t data_length;
    uint32_t tick_start;

