PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_uart.c
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [uart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the tx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->tx_state) {
        HAL_DEBUGE("uart tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock uart */
    HAL_LOCK(uart);

    /* initialize transmit parameters */
    uart->error_state       = HAL_UART_ERROR_NONE;
    uart->txbuffer.buffer   = (uint8_t *)p_buffer;
    uart->txbuffer.length   = length;
    uart->txbuffer.pos      = 0U;
    uart->tx_state          = UART_STATE_BUSY;

    /* calculate the data length */
    data_length = 1U;
    if(RESET != (USART_CTL0(uart->periph) & USART_CTL0_WL)) {
        if(RESET == (USART_CTL0(uart->periph) & USART_CTL0_PCEN)) {
            data_length = 2U;
        }
    }

    /* configure timeout */
    tick_start = hal_sys_basetick_count_get();

    while(uart->txbuffer.pos < uart->txbuffer.length) {
        /* wait for transmit buffer empty */
        while(RESET == hals_uart_flag_get(uart->periph, USART_FLAG_TBE)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    HAL_DEBUGW("uart transmit timeout");
                    /* reset the state */
                    uart->rx_state = UART_STATE_FREE;
                    /* unlock uart */
                    HAL_UNLOCK(uart);
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        /* send data: in case of 9bit&no parity, uint16_t data will be transmitted */
        if(2U == data_length) {
            hals_uart_data_transmit(uart->periph, (*(uint16_t *)uart->txbuffer.buffer & (uint16_t)0x1FFU));
            uart->txbuffer.buffer += 2;
        } else {
            hals_uart_data_transmit(uart->periph, (*uart->txbuffer.buffer & (uint8_t)0xFFU));
            uart->txbuffer.buffer++;
        }
        /* change the transmit pointer */
        uart->txbuffer.pos++;
    }

    /* wait for transmit complete */
    while(RESET == hals_uart_flag_get(uart->periph, USART_FLAG_TC)) {
        if(HAL_TIMEOUT_FOREVER != timeout_ms) {
            if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                HAL_DEBUGW("uart transmit timeout");
                /* reset the state */
                uart->rx_state = UART_STATE_FREE;
                /* unlock uart */
                HAL_UNLOCK(uart);
                return HAL_ERR_TIMEOUT;
            }
        }
    }

    /* change the Tx state to free */
    uart->tx_state = UART_STATE_FREE;

    /* unlock uart */
    HAL_UNLOCK(uart);

    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data, poll receive process and completed status
                the function is blocking
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  timeout_ms: timeout duration
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY, HAL_ERR_TIMEOUT details refer to gd32f3x0_hal.h
*/
int32_t hal_uart_receive_poll(hal_uart_dev_struct *uart, uint8_t *p_buffer, uint32_t length, uint32_t timeout_ms)
{
    uint8_t data_length;
    uint32_t tick_start;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [uart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the rx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->rx_state) {
        HAL_DEBUGE("uart rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock uart */
    HAL_LOCK(uart);

    uart->error_state       = HAL_UART_ERROR_NONE;
    uart->rx_state          = UART_STATE_BUSY;

    /* initialize receive parameters */
    uart->rxbuffer.buffer   = (uint8_t *)p_buffer;
    uart->rxbuffer.length   = length;
    uart->rxbuffer.pos      = 0U;
    uart->data_bit_mask     = _uart_data_bit_mask_get(uart);

    /* calculate the data length */
    data_length = 1U;
    if(RESET != (USART_CTL0(uart->periph) & USART_CTL0_WL)) {
        if(RESET == (USART_CTL0(uart->periph) & USART_CTL0_PCEN)) {
            data_length = 2U;
        }
    }

    /* configure timeout */
    tick_start = hal_sys_basetick_count_get();

    while(uart->rxbuffer.pos < uart->rxbuffer.length) {
        /* wait for read data buffer not empty */
        while(RESET == hals_uart_flag_get(uart->periph, USART_FLAG_RBNE)) {
            if(HAL_TIMEOUT_FOREVER != timeout_ms) {
                if(SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) {
                    HAL_DEBUGW("uart receive timeout");
                    /* reset the state */
                    uart->rx_state = UART_STATE_FREE;
                    /* unlock uart */
                    HAL_UNLOCK(uart);
                    return HAL_ERR_TIMEOUT;
                }
            }
        }

        /* read data: in case of 9bit&no parity, uint16_t data will be receive */
        if(2U == data_length) {
            *(uint16_t *)uart->rxbuffer.buffer = (hals_uart_data_receive(uart->periph) & uart->data_bit_mask);
            uart->rxbuffer.buffer += 2;
        } else {
            *uart->rxbuffer.buffer = (uint8_t)(hals_uart_data_receive(uart->periph) & uart->data_bit_mask);
            uart->rxbuffer.buffer++;
        }
        uart->rxbuffer.pos++;
    }

    /* change the Rx state to free */
    uart->rx_state = UART_STATE_FREE;

    /* unlock uart */
    HAL_UNLOCK(uart);

