PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_uart.c
    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by interrupt method
                the function is non-blocking
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_uart_transmit_interrupt(hal_uart_dev_struct *uart, uint8_t *p_buffer, uint32_t length,
                                    hal_uart_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [uart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the tx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->tx_state) {
        HAL_DEBUGE("uart tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock uart */
    HAL_LOCK(uart);

    uart->tx_state          = UART_STATE_BUSY;
    uart->error_state       = HAL_UART_ERROR_NONE;

    /* initialize transmit parameters */
    uart->txbuffer.buffer   = (uint8_t *)p_buffer;
    uart->txbuffer.length   = length;
    uart->txbuffer.pos      = 0U;
    uart->tx_callback       = (void *)p_user_func;

    /* configure the transmit ready and complete callback as the function implemented */
    uart->uart_irq.transmit_ready_handle    = _uart_transmit_interrupt;
    uart->uart_irq.transmit_complete_handle = _uart_transmit_complete_interrupt;

    /* clear UART TC interrupt flag */
    hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_TC);

    /* enable the TBE interrupt */
    hals_uart_interrupt_enable(uart->periph, USART_INT_TBE);

    /* unlock uart */
    HAL_UNLOCK(uart);

    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by interrupt method
                the function is non-blocking
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_user_func: user callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_uart_receive_interrupt(hal_uart_dev_struct *uart, uint8_t *p_buffer, uint32_t length,
                                   hal_uart_user_cb p_user_func)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [uart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the rx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->rx_state) {
        HAL_DEBUGE("uart rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock uart */
    HAL_LOCK(uart);

    uart->rx_state = UART_STATE_BUSY;
    uart->error_state = HAL_UART_ERROR_NONE;

    /* initialize receive parameters */
    uart->rxbuffer.buffer   = (uint8_t *)p_buffer;
    uart->rxbuffer.length   = length;
    uart->rxbuffer.pos      = 0U;
    uart->data_bit_mask     = _uart_data_bit_mask_get(uart);
    uart->rx_callback       = (void *)p_user_func;

    /* configure rx interrupt hander */
    uart->uart_irq.receive_complete_handle = _uart_receive_interrupt;

    /* enable PERR, ERR, RBNE interrupt */
    hals_uart_interrupt_enable(uart->periph, USART_INT_PERR);
    hals_uart_interrupt_enable(uart->periph, USART_INT_ERR);
    hals_uart_interrupt_enable(uart->periph, USART_INT_RBNE);

    /* unlock uart */
    HAL_UNLOCK(uart);

    return HAL_ERR_NONE;
}

/*!
    \brief      transmit amounts of data by dma method
                the function is non-blocking
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be transmitted
    \param[in]  p_func: pointer to callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_uart_transmit_dma(hal_uart_dev_struct *uart, uint8_t *p_buffer, uint16_t length, hal_uart_user_callback_struct *p_func)
{
    hal_dma_irq_struct dma_irq;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [uart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check the parameter */
    if(NULL == uart->p_dma_tx) {
        HAL_DEBUGE("parameter [uart->p_dma_tx] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the tx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->tx_state) {
        HAL_DEBUGE("uart tx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock uart */
    HAL_LOCK(uart);

    uart->tx_state = UART_STATE_BUSY;
    uart->error_state = HAL_UART_ERROR_NONE;

