PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_uart.c
    /* initialize transmit parameters */
    uart->txbuffer.buffer   = (uint8_t *)p_buffer;
    uart->txbuffer.length   = length;
    uart->txbuffer.pos      = 0U;

    if(NULL != p_func) {
        uart->tx_callback = (void *)p_func->complete_func;
        uart->uart_irq.error_handle = (hal_irq_handle_cb)p_func->error_func;
    } else {
        uart->tx_callback = NULL;
        uart->uart_irq.error_handle = NULL;
    }
    uart->uart_irq.transmit_complete_handle = _uart_transmit_complete_interrupt;

    /* configure DMA interrupt callback function */
    dma_irq.full_finish_handle  = _uart_transmit_dma;
    dma_irq.error_handle        = _uart_dma_error;
    if(NULL != uart->p_dma_tx->dma_irq.half_finish_handle) {
        dma_irq.half_finish_handle = uart->p_dma_tx->dma_irq.half_finish_handle;
    } else {
        dma_irq.half_finish_handle = NULL;
    }

    /* start DMA interrupt mode transfer */
    if(HAL_ERR_NONE != hal_dma_start_interrupt(uart->p_dma_tx, (uint32_t)uart->txbuffer.buffer,
            (uint32_t)&USART_TDATA(uart->periph), uart->txbuffer.length, &dma_irq)) {
        uart->tx_state = UART_STATE_FREE;
        uart->error_state = HAL_UART_ERROR_DMATX;
        /* unlock uart */
        HAL_UNLOCK(uart);

        return HAL_ERR_NONE;
    }

    /* clear UART TC interrupt flag */
    hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_TC);

    /* DMA enable for transmission */
    hals_uart_dma_transmit_config(uart->periph, USART_TRANSMIT_DMA_ENABLE);

    /* unlock uart */
    HAL_UNLOCK(uart);

    return HAL_ERR_NONE;
}

/*!
    \brief      receive amounts of data by dma method
                the function is non-blocking
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to data buffer
    \param[in]  length: number of data to be received
    \param[in]  p_func: pointer to callback function
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_BUSY details refer to gd32f3x0_hal.h
*/
int32_t hal_uart_receive_dma(hal_uart_dev_struct *uart, uint8_t *p_buffer, uint16_t length, hal_uart_user_callback_struct *p_func)
{
    hal_dma_irq_struct dma_irq;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == uart) || (NULL == p_buffer) || (0U == length)) {
        HAL_DEBUGE("parameter [uart] or [p_buffer] or [length] value is invalid");
        return HAL_ERR_ADDRESS;
    }

    /* check the parameter */
    if(NULL == uart->p_dma_rx) {
        HAL_DEBUGE("parameter [uart->p_dma_rx] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* check the rx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->rx_state) {
        HAL_DEBUGE("uart rx has already been used, please wait until run_state change to free ");
        return HAL_ERR_BUSY;
    }

    /* lock uart */
    HAL_LOCK(uart);

    uart->rx_state      = UART_STATE_BUSY;
    uart->error_state   = HAL_UART_ERROR_NONE;

    /* initialize receive parameters */
    uart->rxbuffer.buffer   = (uint8_t *)p_buffer;
    uart->rxbuffer.length   = length;
    uart->rxbuffer.pos      = 0U;
    uart->data_bit_mask     = _uart_data_bit_mask_get(uart);

    if(NULL != p_func) {
        uart->rx_callback = (void *)p_func->complete_func;
        uart->uart_irq.error_handle = (hal_irq_handle_cb)p_func->error_func;
    } else {
        uart->rx_callback = NULL;
        uart->uart_irq.error_handle = NULL;
    }

    /* configure DMA interrupt interrupt callback function */
    dma_irq.full_finish_handle  = _uart_receive_dma;
    dma_irq.error_handle        = _uart_dma_error;
    if(NULL != uart->p_dma_rx->dma_irq.half_finish_handle) {
        dma_irq.half_finish_handle = uart->p_dma_rx->dma_irq.half_finish_handle;
    } else {
        dma_irq.half_finish_handle = NULL;
    }

    /* start DMA interrupt mode transfer */
    if(HAL_ERR_NONE != hal_dma_start_interrupt(uart->p_dma_rx, (uint32_t)&USART_RDATA(uart->periph),
            (uint32_t)uart->rxbuffer.buffer, length, &dma_irq)) {
        uart->tx_state = UART_STATE_FREE;
        uart->error_state = HAL_UART_ERROR_DMARX;
        /* unlock uart */
        HAL_UNLOCK(uart);

        return HAL_ERR_NONE;
    }

    /* enable the usart parity error and error interrupt: (frame error, noise error, overrun error) */
    hals_uart_interrupt_enable(uart->periph, USART_INT_PERR);
    hals_uart_interrupt_enable(uart->periph, USART_INT_ERR);

    /* DMA enable for reception */
    hals_uart_dma_receive_config(uart->periph, USART_RECEIVE_DMA_ENABLE);

    /* lock uart */
    HAL_UNLOCK(uart);

    return HAL_ERR_NONE;
}

/*!
    \brief      pause uart DMA transfer during transmission process
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32f3x0_hal.h
*/
int32_t hal_uart_dma_pause(hal_uart_dev_struct *uart)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart) {
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock uart */
    HAL_LOCK(uart);

    /* check the tx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->tx_state) {
        /* disable DMA transimt */
        hals_uart_dma_transmit_config(uart->periph, USART_TRANSMIT_DMA_DISABLE);
    }

    /* check the rx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->rx_state) {
        /* disable the PERR and ERR interrupt */
        hals_uart_interrupt_disable(uart->periph, USART_INT_PERR);
        hals_uart_interrupt_disable(uart->periph, USART_INT_ERR);

        /* disable DMA receive */
        hals_uart_dma_receive_config(uart->periph, USART_RECEIVE_DMA_DISABLE);
    }

    /* unlock uart */
    HAL_UNLOCK(uart);

