PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_uart.c
    return HAL_ERR_NONE;
}

/*!
    \brief      resume uart DMA transfer during transmission process
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32f3x0_hal.h
*/
int32_t hal_uart_dma_resume(hal_uart_dev_struct *uart)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart) {
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock uart */
    HAL_LOCK(uart);

    /* check the tx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->tx_state) {
        /* enable DMA transimt */
        hals_uart_dma_transmit_config(uart->periph, USART_TRANSMIT_DMA_ENABLE);
    }

    /* check the rx_state wheher is busy or not */
    if(UART_STATE_BUSY == uart->rx_state) {
        /* enable the PERR and ERR interrupt */
        hals_uart_interrupt_enable(uart->periph, USART_INT_PERR);
        hals_uart_interrupt_enable(uart->periph, USART_INT_ERR);

        /* enable DMA receive */
        hals_uart_dma_receive_config(uart->periph, USART_RECEIVE_DMA_ENABLE);
    }

    /* unlock uart */
    HAL_UNLOCK(uart);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop uart transmit transfer
                the function is blocking
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32f3x0_hal.h
*/
int32_t hal_uart_transmit_stop(hal_uart_dev_struct *uart)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart) {
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock uart */
    HAL_LOCK(uart);

    /* disable the TBE and TC interrupt */
    hals_uart_interrupt_disable(uart->periph, USART_INT_TBE);
    hals_uart_interrupt_disable(uart->periph, USART_INT_TC);

    /* disable DMA transimt and stop DMA */
    hals_uart_dma_transmit_config(uart->periph, USART_TRANSMIT_DMA_DISABLE);
    hal_dma_stop(uart->p_dma_tx);

    /* reset the position and state */
    uart->txbuffer.pos = 0;
    uart->tx_state = UART_STATE_FREE;

    /* unlock uart */
    HAL_UNLOCK(uart);

    return HAL_ERR_NONE;
}

/*!
    \brief      stop uart receive transfer
                the function is blocking
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS details refer to gd32f3x0_hal.h
*/
int32_t hal_uart_receive_stop(hal_uart_dev_struct *uart)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameter */
    if(NULL == uart) {
        HAL_DEBUGE("parameter [uart] value is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* lock uart */
    HAL_LOCK(uart);

    /* disable the RBNE, PERR and ERR interrupt */
    hals_uart_interrupt_disable(uart->periph, USART_INT_RBNE);
    hals_uart_interrupt_disable(uart->periph, USART_INT_PERR);
    hals_uart_interrupt_disable(uart->periph, USART_INT_ERR);

    /* disable DMA receive and stop DMA */
    hals_uart_dma_receive_config(uart->periph, USART_RECEIVE_DMA_DISABLE);
    hal_dma_stop(uart->p_dma_rx);

    /* reset the position and state */
    uart->rxbuffer.pos = 0;
    uart->rx_state = UART_STATE_FREE;

    /* clear interrupt error flags */
    hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_PERR);
    hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_FERR);
    hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_NERR);
    hals_uart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_ORERR);

    /* unlock uart */
    HAL_UNLOCK(uart);

    return HAL_ERR_NONE;
}

/*!
    \brief      reset UART
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_deinit(uint32_t uart_periph)
{
    switch(uart_periph) {
    case USART0:
        /* reset USART0 */
        hal_rcu_periph_reset_enable(RCU_USART0RST);
        hal_rcu_periph_reset_disable(RCU_USART0RST);
        break;
    case USART1:
        /* reset USART1 */
        hal_rcu_periph_reset_enable(RCU_USART1RST);
        hal_rcu_periph_reset_disable(RCU_USART1RST);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure UART baud rate value
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  baudval: baud rate value
    \param[out] none
    \retval     none
*/
void hals_uart_baudrate_set(uint32_t uart_periph, uint32_t baudval)
{
    uint32_t uclk = 0U, intdiv = 0U, fradiv = 0U, udiv = 0U;
    switch(uart_periph) {
    /* get clock frequency */
    case USART0:
        /* get USART0 clock */
        uclk = hals_rcu_clock_freq_get(CK_USART);
        break;
    case USART1:
        /* get USART1 clock */
        uclk = hals_rcu_clock_freq_get(CK_APB1);
        break;
    default:
        break;
    }
    if(USART_CTL0(uart_periph) & USART_CTL0_OVSMOD) {
        /* oversampling by 8, configure the value of USART_BAUD */
        udiv = ((2U * uclk) + (baudval / 2U)) / baudval;
        intdiv = udiv & 0x0000fff0U;
        fradiv = (udiv >> 1U) & 0x00000007U;
        USART_BAUD(uart_periph) = ((USART_BAUD_FRADIV | USART_BAUD_INTDIV) & (intdiv | fradiv));
    } else {
        /* oversampling by 16, configure the value of USART_BAUD */
        udiv = (uclk + (baudval / 2U)) / baudval;
        intdiv = udiv & 0x0000fff0U;
        fradiv = udiv & 0x0000000fU;
        USART_BAUD(uart_periph) = ((USART_BAUD_FRADIV | USART_BAUD_INTDIV) & (intdiv | fradiv));
    }
}

/*!
    \brief      configure UART parity
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  paritycfg: UART parity configure
                only one parameter can be selected which is shown as below:
      \arg        USART_PM_NONE: no parity
      \arg        USART_PM_ODD: odd parity
      \arg        USART_PM_EVEN: even parity
    \param[out] none
    \retval     none
*/
void hals_uart_parity_config(uint32_t uart_periph, uint32_t paritycfg)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);
    /* clear USART_CTL0 PM,PCEN bits */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_PM | USART_CTL0_PCEN);
    /* configure UART parity mode */
    USART_CTL0(uart_periph) |= paritycfg;
}

/*!
    \brief      configure UART word length
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  wlen: UART word length configure
                only one parameter can be selected which is shown as below:
      \arg        USART_WL_8BIT: 8 bits
      \arg        USART_WL_9BIT: 9 bits
    \param[out] none
    \retval     none
*/
void hals_uart_word_length_set(uint32_t uart_periph, uint32_t wlen)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);
    /* clear USART_CTL0 WL bit */
    USART_CTL0(uart_periph) &= ~USART_CTL0_WL;
    /* configure UART word length */
    USART_CTL0(uart_periph) |= wlen;
}

/*!
    \brief      configure UART stop bit length
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  stblen: UART stop bit configure
                only one parameter can be selected which is shown as below:
      \arg        USART_STB_1BIT: 1 bit
      \arg        USART_STB_0_5BIT: 0.5bit
      \arg        USART_STB_2BIT: 2 bits
      \arg        USART_STB_1_5BIT: 1.5bit
    \param[out] none
    \retval     none
*/
void hals_uart_stop_bit_set(uint32_t uart_periph, uint32_t stblen)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);
    /* clear USART_CTL1 STB bits */
    USART_CTL1(uart_periph) &= ~USART_CTL1_STB;
    USART_CTL1(uart_periph) |= stblen;
}

/*!
    \brief      enable UART
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_enable(uint32_t uart_periph)
{
    USART_CTL0(uart_periph) |= USART_CTL0_UEN;
}

/*!
    \brief      disable UART
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_disable(uint32_t uart_periph)
{
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);
}

/*!
    \brief      configure UART transmitter
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  txconfig: enable or disable UART transmitter
                only one parameter can be selected which is shown as below:
      \arg        USART_TRANSMIT_ENABLE: enable UART transmission
      \arg        USART_TRANSMIT_DISABLE: enable UART transmission
    \param[out] none
    \retval     none
*/
void hals_uart_transmit_config(uint32_t uart_periph, uint32_t txconfig)
{
    USART_CTL0(uart_periph) &= ~USART_CTL0_TEN;
    /* configure transfer mode */
    USART_CTL0(uart_periph) |= txconfig;
}

/*!
    \brief      configure UART receiver
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  rxconfig: enable or disable UART receiver
                only one parameter can be selected which is shown as below:
      \arg        USART_RECEIVE_ENABLE: enable UART reception
      \arg        USART_RECEIVE_DISABLE: disable UART reception
    \param[out] none
    \retval     none
*/
void hals_uart_receive_config(uint32_t uart_periph, uint32_t rxconfig)
{
    USART_CTL0(uart_periph) &= ~USART_CTL0_REN;
    /* configure receiver mode */
    USART_CTL0(uart_periph) |= rxconfig;
}

/*!
    \brief      data is transmitted/received with the LSB/MSB first
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  msbf: LSB/MSB
                only one parameter can be selected which is shown as below:
      \arg        USART_MSBF_LSB: LSB first
      \arg        USART_MSBF_MSB: MSB first
    \param[out] none
    \retval     none
*/
void hals_uart_data_first_config(uint32_t uart_periph, uint32_t msbf)
{
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);
    /* configure LSB or MSB first */
    USART_CTL1(uart_periph) &= ~(USART_CTL1_MSBF);
    USART_CTL1(uart_periph) |= msbf;
}

/*!
    \brief      configure UART inversion
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  invertpara: refer to usart_invert_enum
                only one parameter can be selected which is shown as below:
      \arg        USART_DINV_ENABLE: data bit level inversion
      \arg        USART_DINV_DISABLE: data bit level not inversion
      \arg        USART_TXPIN_ENABLE: TX pin level inversion
      \arg        USART_TXPIN_DISABLE: TX pin level not inversion
      \arg        USART_RXPIN_ENABLE: RX pin level inversion
      \arg        USART_RXPIN_DISABLE: RX pin level not inversion
      \arg        USART_SWAP_ENABLE: swap TX/RX pins
      \arg        USART_SWAP_DISABLE: not swap TX/RX pins
    \param[out] none
    \retval     none
*/
void hals_uart_invert_config(uint32_t uart_periph, usart_invert_enum invertpara)
{
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);
    /* inverted or not the specified signal */
    switch(invertpara) {
    case USART_DINV_ENABLE:
        USART_CTL1(uart_periph) |= USART_CTL1_DINV;
        break;
    case USART_DINV_DISABLE:
        USART_CTL1(uart_periph) &= ~(USART_CTL1_DINV);
        break;
    case USART_TXPIN_ENABLE:
        USART_CTL1(uart_periph) |= USART_CTL1_TINV;
        break;
    case USART_TXPIN_DISABLE:
        USART_CTL1(uart_periph) &= ~(USART_CTL1_TINV);
        break;
    case USART_RXPIN_ENABLE:
        USART_CTL1(uart_periph) |= USART_CTL1_RINV;
        break;
    case USART_RXPIN_DISABLE:
        USART_CTL1(uart_periph) &= ~(USART_CTL1_RINV);
        break;
    case USART_SWAP_ENABLE:
        USART_CTL1(uart_periph) |= USART_CTL1_STRP;
        break;
    case USART_SWAP_DISABLE:
        USART_CTL1(uart_periph) &= ~(USART_CTL1_STRP);
        break;
    default:
        break;
    }
}

/*!
    \brief      enable the UART overrun function
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_overrun_enable(uint32_t uart_periph)
{
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);
    /* enable overrun function */
    USART_CTL2(uart_periph) &= ~(USART_CTL2_OVRD);
}

/*!
    \brief      disable the UART overrun function
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_overrun_disable(uint32_t uart_periph)
{
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);
    /* disable overrun function */
    USART_CTL2(uart_periph) |= USART_CTL2_OVRD;
}

/*!
    \brief      configure the UART oversample mode
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  oversamp: oversample value
                only one parameter can be selected which is shown as below:
      \arg        USART_OVSMOD_8: oversampling by 8
      \arg        USART_OVSMOD_16: oversampling by 16
    \param[out] none
    \retval     none
*/
void hals_uart_oversample_config(uint32_t uart_periph, uint32_t oversamp)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);
    /* clear OVSMOD bit */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_OVSMOD);
    USART_CTL0(uart_periph) |= oversamp;
}

/*!
    \brief      configure the sample bit method
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  osb: sample bit
                only one parameter can be selected which is shown as below:
      \arg        USART_OSB_1BIT: 1 bit
      \arg        USART_OSB_3BIT: 3 bits
    \param[out] none
    \retval     none
*/
void hals_uart_sample_bit_config(uint32_t uart_periph, uint32_t osb)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(uart_periph) &= ~(USART_CTL2_OSB);
    USART_CTL2(uart_periph) |= osb;
}

/*!
    \brief      enable receiver timeout
    \param[in]  uart_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_uart_receiver_timeout_enable(uint32_t uart_periph)
{
    USART_CTL1(uart_periph) |= USART_CTL1_RTEN;
}

/*!
    \brief      disable receiver timeout
    \param[in]  uart_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_uart_receiver_timeout_disable(uint32_t uart_periph)
{
    USART_CTL1(uart_periph) &= ~(USART_CTL1_RTEN);
}

/*!
    \brief      configure receiver timeout threshold
    \param[in]  uart_periph: USARTx(x=0)
    \param[in]  rtimeout: 0x00000000-0x00FFFFFF, receiver timeout value in terms of number of baud clocks
    \param[out] none
    \retval     none
*/
void hals_uart_receiver_timeout_threshold_config(uint32_t uart_periph, uint32_t rtimeout)
{
    USART_RT(uart_periph) &= ~(USART_RT_RT);
    USART_RT(uart_periph) |= rtimeout;
}

/*!
    \brief      UART transmit data function
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  data: data of transmission
    \param[out] none
    \retval     none
*/
void hals_uart_data_transmit(uint32_t uart_periph, uint16_t data)
{
    USART_TDATA(uart_periph) = (USART_TDATA_TDATA & (uint32_t)data);
}

/*!
    \brief      UART receive data function
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     data of received
*/
uint16_t hals_uart_data_receive(uint32_t uart_periph)
{
    return (uint16_t)(GET_BITS(USART_RDATA(uart_periph), 0U, 8U));
}

/*!
    \brief      enable UART command
    \param[in]  uart_periph: USARTx(x=0,1,2)
    \param[in]  cmdtype: command type
                only one parameter can be selected which is shown as below:
      \arg        USART_CMD_SBKCMD: send break command
      \arg        USART_CMD_MMCMD: mute mode command
      \arg        USART_CMD_RXFCMD: receive data flush command
      \arg        USART_CMD_TXFCMD: transmit data flush request
    \param[out] none
    \retval     none
*/
void hals_uart_command_enable(uint32_t uart_periph, uint32_t cmdtype)
{
    USART_CMD(uart_periph) |= (cmdtype);
}

/*!
    \brief      configure the address of the UART in wake up by address match mode
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  addr: 0x00-0xFF, address of UART terminal
    \param[out] none
    \retval     none
*/
void hals_uart_address_config(uint32_t uart_periph, uint8_t addr)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL1(uart_periph) &= ~(USART_CTL1_ADDR);
    USART_CTL1(uart_periph) |= (USART_CTL1_ADDR & (((uint32_t)addr) << CTL1_ADDR_OFFSET));
}

/*!
    \brief      configure address detection mode
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  addmod: address detection mode
                only one parameter can be selected which is shown as below:
      \arg        USART_ADDM_4BIT: 4 bits
      \arg        USART_ADDM_FULLBIT: full bits
    \param[out] none
    \retval     none
*/
void hals_uart_address_detection_mode_config(uint32_t uart_periph, uint32_t addmod)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL1(uart_periph) &= ~(USART_CTL1_ADDM);
    USART_CTL1(uart_periph) |= USART_CTL1_ADDM & (addmod);
}

/*!
    \brief      enable mute mode
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_mute_mode_enable(uint32_t uart_periph)
{
    USART_CTL0(uart_periph) |= USART_CTL0_MEN;
}

/*!
    \brief      disable mute mode
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_mute_mode_disable(uint32_t uart_periph)
{
    USART_CTL0(uart_periph) &= ~(USART_CTL0_MEN);
}

/*!
    \brief      configure wakeup method in mute mode
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  wmethod: two methods be used to enter or exit the mute mode
                only one parameter can be selected which is shown as below:
      \arg        USART_WM_IDLE: idle line
      \arg        USART_WM_ADDR: address match
    \param[out] none
    \retval     none
*/
void hals_uart_mute_mode_wakeup_config(uint32_t uart_periph, uint32_t wmethod)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL0(uart_periph) &= ~(USART_CTL0_WM);
    USART_CTL0(uart_periph) |= wmethod;
}

/*!
    \brief      enable LIN mode
    \param[in]  uart_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_uart_lin_mode_enable(uint32_t uart_periph)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL1(uart_periph) |= USART_CTL1_LMEN;
}

/*!
    \brief      disable LIN mode
    \param[in]  uart_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_uart_lin_mode_disable(uint32_t uart_periph)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);

