PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_uart.c
    USART_CTL1(uart_periph) &= ~(USART_CTL1_LMEN);
}

/*!
    \brief      configure LIN break frame length
    \param[in]  uart_periph: USARTx(x=0)
    \param[in]  lblen: LIN break detection length
                only one parameter can be selected which is shown as below:
      \arg        USART_LBLEN_10B: 10 bits break detection
      \arg        USART_LBLEN_11B: 11 bits break detection
    \param[out] none
    \retval     none
*/
void hals_uart_lin_break_detection_length_config(uint32_t uart_periph, uint32_t lblen)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);
    USART_CTL1(uart_periph) &= ~(USART_CTL1_LBLEN);
    USART_CTL1(uart_periph) |= USART_CTL1_LBLEN & (lblen);
}

/*!
    \brief      enable half-duplex mode
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_halfduplex_enable(uint32_t uart_periph)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(uart_periph) |= USART_CTL2_HDEN;
}

/*!
    \brief      disable half-duplex mode
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_halfduplex_disable(uint32_t uart_periph)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(uart_periph) &= ~(USART_CTL2_HDEN);
}

/*!
    \brief      configure hardware flow control RTS
    \param[in]  usart_periph: USARTx(x=0,1)
    \param[in]  rtsconfig: enable or disable RTS
                only one parameter can be selected which is shown as below:
      \arg        USART_RTS_ENABLE:  enable RTS
      \arg        USART_RTS_DISABLE: disable RTS
    \param[out] none
    \retval     none
*/
void hals_uart_hardware_flow_rts_config(uint32_t usart_periph, uint32_t rtsconfig)
{
    /* disable UART */
    USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(usart_periph) &= ~(USART_CTL2_RTSEN);
    USART_CTL2(usart_periph) |= rtsconfig;
}

/*!
    \brief      configure hardware flow control CTS
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  ctsconfig:  enable or disable CTS
                only one parameter can be selected which is shown as below:
      \arg        USART_CTS_ENABLE:  enable CTS
      \arg        USART_CTS_DISABLE: disable CTS
    \param[out] none
    \retval     none
*/
void hals_uart_hardware_flow_cts_config(uint32_t uart_periph, uint32_t ctsconfig)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(uart_periph) &= ~USART_CTL2_CTSEN;
    USART_CTL2(uart_periph) |= ctsconfig;
}

/*!
    \brief      enable RS485 driver
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_rs485_driver_enable(uint32_t uart_periph)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(uart_periph) |= USART_CTL2_DEM;
}

/*!
    \brief      disable RS485 driver
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_rs485_driver_disable(uint32_t uart_periph)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL2(uart_periph) &= ~(USART_CTL2_DEM);
}

/*!
    \brief      configure driver enable assertion time
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  deatime: 0x00000000-0x0000001F
    \param[out] none
    \retval     none
*/
void hals_uart_driver_assertime_config(uint32_t uart_periph, uint32_t deatime)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL0(uart_periph) &= ~(USART_CTL0_DEA);
    USART_CTL0(uart_periph) |= (USART_CTL0_DEA & ((deatime) << CTL0_DEA_OFFSET));
}

/*!
    \brief      configure driver enable de-assertion time
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  dedtime: 0x00000000-0x0000001F
    \param[out] none
    \retval     none
*/
void hals_uart_driver_deassertime_config(uint32_t uart_periph, uint32_t dedtime)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);

    USART_CTL0(uart_periph) &= ~(USART_CTL0_DED);
    USART_CTL0(uart_periph) |= (USART_CTL0_DED & ((dedtime) << CTL0_DED_OFFSET));
}

/*!
    \brief      configure driver enable polarity mode
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  dep: DE signal
                only one parameter can be selected which is shown as below:
      \arg        USART_DEP_HIGH: DE signal is active high
      \arg        USART_DEP_LOW: DE signal is active low
    \param[out] none
    \retval     none
*/
void hals_uart_depolarity_config(uint32_t uart_periph, uint32_t dep)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);
    /* reset DEP bit */
    USART_CTL2(uart_periph) &= ~(USART_CTL2_DEP);
    USART_CTL2(uart_periph) |= (USART_CTL2_DEP & dep);
}

/*!
    \brief      configure UART DMA reception
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  dmacmd: UART DMA mode
                only one parameter can be selected which is shown as below:
      \arg        USART_RECEIVE_DMA_ENABLE: enable UART DMA for reception
      \arg        USART_RECEIVE_DMA_DISABLE: disable UART DMA for reception
    \param[out] none
    \retval     none
*/
void hals_uart_dma_receive_config(uint32_t uart_periph, uint8_t dmacmd)
{
    USART_CTL2(uart_periph) &= ~USART_CTL2_DENR;
    USART_CTL2(uart_periph) |= (USART_CTL2_DENR & dmacmd);
}

/*!
    \brief      configure UART DMA transmission
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  dmacmd: UART DMA mode
                only one parameter can be selected which is shown as below:
      \arg        USART_TRANSMIT_DMA_ENABLE: enable UART DMA for transmission
      \arg        USART_TRANSMIT_DMA_DISABLE: disable UART DMA for transmission
    \param[out] none
    \retval     none
*/
void hals_uart_dma_transmit_config(uint32_t uart_periph, uint8_t dmacmd)
{
    USART_CTL2(uart_periph) &= ~USART_CTL2_DENT;
    USART_CTL2(uart_periph) |= (USART_CTL2_DENT & dmacmd);
}

/*!
    \brief      enable DMA on reception error
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_reception_error_dma_enable(uint32_t uart_periph)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);
    USART_CTL2(uart_periph) &= ~(USART_CTL2_DDRE);
}

/*!
    \brief      disable DMA on reception error
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_reception_error_dma_disable(uint32_t uart_periph)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);
    USART_CTL2(uart_periph) |= USART_CTL2_DDRE;
}

/*!
    \brief      enable UART to wakeup the MCU from deep-sleep mode
    \param[in]  uart_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_uart_wakeup_enable(uint32_t uart_periph)
{
    USART_CTL0(uart_periph) |= USART_CTL0_UESM;
}

/*!
    \brief      disable UART to wakeup the MCU from deep-sleep mode
    \param[in]  uart_periph: USARTx(x=0)
    \param[out] none
    \retval     none
*/
void hals_uart_wakeup_disable(uint32_t uart_periph)
{
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UESM);
}

/*!
    \brief      configure the UART wakeup mode from deep-sleep mode
    \param[in]  uart_periph: USARTx(x=0)
    \param[in]  wum: wakeup mode
                only one parameter can be selected which is shown as below:
      \arg        USART_WUM_ADDR: WUF active on address match
      \arg        USART_WUM_STARTB: WUF active on start bit
      \arg        USART_WUM_RBNE: WUF active on RBNE
    \param[out] none
    \retval     none
*/
void hals_uart_wakeup_mode_config(uint32_t uart_periph, uint32_t wum)
{
    /* disable UART */
    USART_CTL0(uart_periph) &= ~(USART_CTL0_UEN);
    /* reset WUM bit */
    USART_CTL2(uart_periph) &= ~(USART_CTL2_WUM);
    USART_CTL2(uart_periph) |= USART_CTL2_WUM & (wum);
}

/*!
    \brief      enable receive FIFO
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_receive_fifo_enable(uint32_t uart_periph)
{
    USART_RFCS(uart_periph) |= USART_RFCS_RFEN;
}

/*!
    \brief      disable receive FIFO
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     none
*/
void hals_uart_receive_fifo_disable(uint32_t uart_periph)
{
    USART_RFCS(uart_periph) &= ~(USART_RFCS_RFEN);
}

/*!
    \brief      read receive FIFO counter number
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[out] none
    \retval     receive FIFO counter number
*/
uint8_t hals_uart_receive_fifo_counter_number(uint32_t uart_periph)
{
    return (uint8_t)(GET_BITS(USART_RFCS(uart_periph), 12U, 14U));
}

/*!
    \brief      get UART status
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        USART_FLAG_PERR: parity error flag
      \arg        USART_FLAG_FERR: frame error flag
      \arg        USART_FLAG_NERR: noise error flag
      \arg        USART_FLAG_ORERR: overrun error flag
      \arg        USART_FLAG_IDLE: idle line detected flag
      \arg        USART_FLAG_RBNE: read data buffer not empty
      \arg        USART_FLAG_TC: transmission complete flag
      \arg        USART_FLAG_TBE: transmit data register empty
      \arg        USART_FLAG_LBD: LIN break detected flag
      \arg        USART_FLAG_CTSF: CTS change flag
      \arg        USART_FLAG_CTS: CTS level
      \arg        USART_FLAG_RT: receiver timeout flag
      \arg        USART_FLAG_EB: end of block flag
      \arg        USART_FLAG_BSY: busy flag
      \arg        USART_FLAG_AM: address match flag
      \arg        USART_FLAG_SB: send break flag
      \arg        USART_FLAG_RWU: receiver wakeup from mute mode.
      \arg        USART_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        USART_FLAG_TEA: transmit enable acknowledge flag
      \arg        USART_FLAG_REA: receive enable acknowledge flag
      \arg        USART_FLAG_EPERR: early parity error flag
      \arg        USART_FLAG_RFE: receive FIFO empty flag
      \arg        USART_FLAG_RFF: receive FIFO full flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hals_uart_flag_get(uint32_t uart_periph, usart_flag_enum flag)
{
    if(RESET != (USART_REG_VAL(uart_periph, flag) & BIT(USART_BIT_POS(flag)))) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear UART status
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        USART_FLAG_PERR: parity error flag
      \arg        USART_FLAG_FERR: frame error flag
      \arg        USART_FLAG_NERR: noise error flag
      \arg        USART_FLAG_ORERR: overrun error flag
      \arg        USART_FLAG_IDLE: idle line detected flag
      \arg        USART_FLAG_TC: transmission complete flag
      \arg        USART_FLAG_LBD: LIN break detected flag
      \arg        USART_FLAG_CTSF: CTS change flag
      \arg        USART_FLAG_RT: receiver timeout flag
      \arg        USART_FLAG_EB: end of block flag
      \arg        USART_FLAG_AM: address match flag
      \arg        USART_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        USART_FLAG_EPERR: early parity error flag
    \param[out] none
    \retval     none
*/
void hals_uart_flag_clear(uint32_t uart_periph, usart_flag_enum flag)
{
    USART_INTC(uart_periph) |= BIT(USART_BIT_POS(flag));
}

/*!
    \brief      enable UART interrupt
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  interrupt: interrupt
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_IDLE: idle line detected interrupt
      \arg        USART_INT_RBNE: read data buffer not empty interrupt and overrun error interrupt
      \arg        USART_INT_TC: transmission complete interrupt
      \arg        USART_INT_TBE: transmitter buffer empty interrupt
      \arg        USART_INT_PERR: parity error interrupt
      \arg        USART_INT_AM: address match interrupt
      \arg        USART_INT_RT: receiver timeout interrupt
      \arg        USART_INT_EB: end of block interrupt
      \arg        USART_INT_LBD: LIN break detection interrupt
      \arg        USART_INT_ERR: error interrupt
      \arg        USART_INT_CTS: CTS interrupt
      \arg        USART_INT_WU: wakeup from deep-sleep mode interrupt
      \arg        USART_INT_RFF: receive FIFO full interrupt
    \param[out] none
    \retval     none
*/
void hals_uart_interrupt_enable(uint32_t uart_periph, usart_interrupt_enum interrupt)
{
    USART_REG_VAL(uart_periph, interrupt) |= BIT(USART_BIT_POS(interrupt));
}

/*!
    \brief      disable UART interrupt
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  interrupt: interrupt
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_IDLE: idle interrupt
      \arg        USART_INT_RBNE: read data buffer not empty interrupt and overrun error interrupt
      \arg        USART_INT_TC: transmission complete interrupt
      \arg        USART_INT_TBE: transmitter buffer empty interrupt
      \arg        USART_INT_PERR: parity error interrupt
      \arg        USART_INT_AM: address match interrupt
      \arg        USART_INT_RT: receiver timeout interrupt
      \arg        USART_INT_EB: end of block interrupt
      \arg        USART_INT_LBD: LIN break detection interrupt
      \arg        USART_INT_ERR: error interrupt
      \arg        USART_INT_CTS: CTS interrupt
      \arg        USART_INT_WU: wakeup from deep-sleep mode interrupt
      \arg        USART_INT_RFF: receive FIFO full interrupt
    \param[out] none
    \retval     none
*/
void hals_uart_interrupt_disable(uint32_t uart_periph, usart_interrupt_enum interrupt)
{
    USART_REG_VAL(uart_periph, interrupt) &= ~BIT(USART_BIT_POS(interrupt));
}

/*!
    \brief      get UART interrupt flag status
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  int_flag: interrupt and flag type, refer to usart_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_FLAG_EB: end of block interrupt flag
      \arg        USART_INT_FLAG_RT: receiver timeout interrupt flag
      \arg        USART_INT_FLAG_AM: address match interrupt flag
      \arg        USART_INT_FLAG_PERR: parity error interrupt flag
      \arg        USART_INT_FLAG_TBE: transmitter buffer empty interrupt flag
      \arg        USART_INT_FLAG_TC: transmission complete interrupt flag
      \arg        USART_INT_FLAG_RBNE: read data buffer not empty interrupt flag
      \arg        USART_INT_FLAG_RBNE_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_IDLE: idle line detected interrupt flag
      \arg        USART_INT_FLAG_LBD: LIN break detected interrupt flag
      \arg        USART_INT_FLAG_WU: wakeup from deep-sleep mode interrupt flag
      \arg        USART_INT_FLAG_CTS: CTS interrupt flag
      \arg        USART_INT_FLAG_ERR_NERR: noise error interrupt flag
      \arg        USART_INT_FLAG_ERR_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_ERR_FERR: frame error interrupt flag
      \arg        USART_INT_FLAG_RFF: receive FIFO full interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus hals_uart_interrupt_flag_get(uint32_t uart_periph, usart_interrupt_flag_enum int_flag)
{
    uint32_t intenable = 0U, flagstatus = 0U;
    /* get the interrupt enable bit status */
    intenable = (USART_REG_VAL(uart_periph, int_flag) & BIT(USART_BIT_POS(int_flag)));
    /* get the corresponding flag bit status */
    flagstatus = (USART_REG_VAL2(uart_periph, int_flag) & BIT(USART_BIT_POS2(int_flag)));

    if(flagstatus && intenable) {
        return SET;
    } else {
        return RESET;
    }
}

/*!
    \brief      clear UART interrupt flag
    \param[in]  uart_periph: USARTx(x=0,1)
    \param[in]  flag: UART interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_FLAG_EB: end of block interrupt flag
      \arg        USART_INT_FLAG_RT: receiver timeout interrupt flag
      \arg        USART_INT_FLAG_AM: address match interrupt flag
      \arg        USART_INT_FLAG_PERR: parity error interrupt flag
      \arg        USART_INT_FLAG_TC: transmission complete interrupt flag
      \arg        USART_INT_FLAG_RBNE_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_IDLE: idle line detected interrupt flag
      \arg        USART_INT_FLAG_LBD: LIN break detected interrupt flag
      \arg        USART_INT_FLAG_WU: wakeup from deep-sleep mode interrupt flag
      \arg        USART_INT_FLAG_CTS: CTS change interrupt flag
      \arg        USART_INT_FLAG_ERR_FERR: frame error interrupt flag
      \arg        USART_INT_FLAG_ERR_NERR: noise detected interrupt flag
      \arg        USART_INT_FLAG_ERR_ORERR: overrun error interrupt flag
      \arg        USART_INT_FLAG_RFF: receive FIFO full interrupt flag
    \param[out] none
    \retval     none
*/
void hals_uart_interrupt_flag_clear(uint32_t uart_periph, usart_interrupt_flag_enum int_flag)
{
    if(USART_INT_FLAG_RFF == int_flag) {
        USART_RFCS(uart_periph) &= (uint32_t)(~USART_RFCS_RFFINT);
    } else {
        USART_INTC(uart_periph) |= BIT(USART_BIT_POS2(int_flag));
    }
}

/*!
    \brief      get the mask of data bit
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the mask of data bit(0x7F, 0xFF, 0x1FF)
*/
static uint16_t _uart_data_bit_mask_get(hal_uart_dev_struct *uart)
{
    uint16_t reval;

    if(RESET != (USART_CTL0(uart->periph) & USART_CTL0_WL)) {
        /* check whether the PCEN is enabled */
        if(RESET != (USART_CTL0(uart->periph) & USART_CTL0_PCEN)) {
            reval = 0xFFU;
        } else {
            reval = 0x1FFU;
        }
    } else {
        /* check whether the PCEN is enabled */
        if(RESET != (USART_CTL0(uart->periph) & USART_CTL0_PCEN)) {
            reval = 0x7FU;
        } else {
            reval = 0xFFU;
        }
    }

    return reval;
}

/*!
    \brief      get uart error flag
    \param[in]  uart: uart device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     SET or RESET
*/
static FlagStatus _uart_error_flag_get(hal_uart_dev_struct *uart)
{
    if(0U == (USART_STAT(uart->periph) & (uint32_t)(USART_STAT_PERR | USART_STAT_FERR | \
              USART_STAT_ORERR | USART_STAT_NERR))) {
        return RESET;
    } else {
        return SET;
    }
}

/*!
    \brief      handle the transmit complete interrupt
    \param[in]  uart: pointer to a uart device information structure
    \param[out] none
    \retval     none
*/
static void _uart_transmit_complete_interrupt(void *uart)
{
    hal_uart_dev_struct *p_uart = uart;
    hal_uart_user_cb p_func = (hal_uart_user_cb)p_uart->tx_callback;

