PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_uart.c
    /* disable the transmit complete interrupt */
    hals_uart_interrupt_disable(p_uart->periph, USART_INT_TC);

    /* reset transmit_complete_handle and tx_state */
    p_uart->uart_irq.transmit_complete_handle = NULL;
    p_uart->tx_state = UART_STATE_FREE;

    if(NULL != p_func) {
        /* if there is a user transmit complete callback */
        p_func(p_uart);
    }
}

/*!
    \brief      handle the transmit interrupt
    \param[in]  uart: pointer to a uart device information structure
    \param[out] none
    \retval     none
*/
static void _uart_transmit_interrupt(void *uart)
{
    hal_uart_dev_struct *p_uart = uart;

    if(p_uart->txbuffer.pos < p_uart->txbuffer.length) {
        /* send data: in case of 9bit&no parity, uint16_t data will be transmitted */
        if((RESET != (USART_CTL0(p_uart->periph) & USART_CTL0_WL)) && \
                (RESET == (USART_CTL0(p_uart->periph) & USART_CTL0_PCEN))) {
            /* 9-bit data, none parity */
            hals_uart_data_transmit(p_uart->periph, (*(uint16_t *)p_uart->txbuffer.buffer & (uint16_t)0x1FFU));
            p_uart->txbuffer.buffer += 2;
        } else {
            /* 9-bit data, with parity or 8-bit data */
            hals_uart_data_transmit(p_uart->periph, (*p_uart->txbuffer.buffer & (uint8_t)0xFFU));
            p_uart->txbuffer.buffer++;
        }
        p_uart->txbuffer.pos++;
    } else {
        /* disable the TBE interrupt, enable the TC interrupt and reset the transmit_ready_handle */
        hals_uart_interrupt_disable(p_uart->periph, USART_INT_TBE);
        hals_uart_interrupt_enable(p_uart->periph, USART_INT_TC);
        p_uart->uart_irq.transmit_ready_handle = NULL;
    }
}

/*!
    \brief      handle the receive interrupt
    \param[in]  uart: pointer to a uart device information structure
    \param[out] none
    \retval     none
*/
static void _uart_receive_interrupt(void *uart)
{
    hal_uart_dev_struct *p_uart = uart;
    hal_uart_user_cb p_func = (hal_uart_user_cb)p_uart->rx_callback;

    /* store the received data */
    if(0x1FFU == p_uart->data_bit_mask) {
        *(uint16_t *)p_uart->rxbuffer.buffer = (hals_uart_data_receive(p_uart->periph) &
                                                p_uart->data_bit_mask);
        p_uart->rxbuffer.buffer += 2U;
    } else {
        *p_uart->rxbuffer.buffer = (uint8_t)(hals_uart_data_receive(p_uart->periph) &
                                             p_uart->data_bit_mask);
        p_uart->rxbuffer.buffer++;
    }
    p_uart->rxbuffer.pos++;

    /* receive is finished */
    if(p_uart->rxbuffer.pos == p_uart->rxbuffer.length) {
        /* disable PERR, ERR, RBNE interrupt */
        hals_uart_interrupt_disable(p_uart->periph, USART_INT_PERR);
        hals_uart_interrupt_disable(p_uart->periph, USART_INT_ERR);
        hals_uart_interrupt_disable(p_uart->periph, USART_INT_RBNE);

        /* reset receive_complete_handle and rx_state */
        p_uart->uart_irq.receive_complete_handle = NULL;
        p_uart->rx_state = UART_STATE_FREE;

        if(NULL != p_func) {
            /* if there is a user receive complete callback */
            p_func(p_uart);
        }
    }
}

/*!
    \brief      handle the uart DMA transmit process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _uart_transmit_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_uart_dev_struct *p_uart;
    hal_uart_user_cb p_func;

    p_dma = (hal_dma_dev_struct *)dma;
    p_uart = (hal_uart_dev_struct *)p_dma->p_periph;
    p_func = (hal_uart_user_cb)p_uart->tx_callback;

    /* DMA normal mode */
    if(RESET == (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)) {
        p_uart->txbuffer.pos = p_uart->txbuffer.length;
        hals_uart_dma_transmit_config(p_uart->periph, USART_TRANSMIT_DMA_DISABLE);
        /* enable TC interrupt */
        hals_uart_interrupt_enable(p_uart->periph, USART_INT_TC);
        /* reset rx_state */
        p_uart->tx_state = UART_STATE_FREE;
    }

    if(NULL != p_func) {
        /* if there is a user receive complete callback */
        p_func(p_uart);
    }
}

/*!
    \brief      handle the uart DMA receive process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _uart_receive_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_uart_dev_struct *p_uart;
    hal_uart_user_cb p_func;

    p_dma = (hal_dma_dev_struct *)dma;
    p_uart = (hal_uart_dev_struct *)p_dma->p_periph;
    p_func = (hal_uart_user_cb)p_uart->rx_callback;

    /* DMA normal mode */
    if(RESET == (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN)) {
        p_uart->rxbuffer.pos = p_uart->rxbuffer.length;
        /* disable DMA receive, PERR and ERR interrupt */
        hals_uart_dma_receive_config(p_uart->periph, USART_RECEIVE_DMA_DISABLE);
        hals_uart_interrupt_disable(p_uart->periph, USART_INT_PERR);
        hals_uart_interrupt_disable(p_uart->periph, USART_INT_ERR);
        /* reset rx_state */
        p_uart->rx_state = UART_STATE_FREE;
    }

    if(NULL != p_func) {
        /* if there is a user receive complete callback */
        p_func(p_uart);
    }
}

/*!
    \brief      handle the uart DMA error process
    \param[in]  dma: pointer to a DMA device information structure
    \param[out] none
    \retval     none
*/
static void _uart_dma_error(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_uart_dev_struct *p_uart;

    p_dma = (hal_dma_dev_struct *)dma;
    p_uart = (hal_uart_dev_struct *)p_dma->p_periph;

    if(UART_STATE_BUSY == p_uart->tx_state) {
        /* transmit state is busy */
        p_uart->error_state |= HAL_UART_ERROR_DMATX;
        p_uart->last_error = HAL_UART_ERROR_DMATX;
        p_uart->txbuffer.pos = p_uart->txbuffer.length;
        /* disable DMA transmit and reset tx_state */
        hals_uart_dma_transmit_config(p_uart->periph, USART_TRANSMIT_DMA_DISABLE);
        p_uart->tx_state = UART_STATE_FREE;
    } else if(UART_STATE_BUSY == p_uart->rx_state) {
        /* receive state is busy */
        p_uart->error_state |= HAL_UART_ERROR_DMARX;
        p_uart->last_error = HAL_UART_ERROR_DMARX;
        p_uart->rxbuffer.pos = p_uart->rxbuffer.length;
        /* disable DMA receive, PERR, ERR interrupt */
        hals_uart_dma_receive_config(p_uart->periph, USART_RECEIVE_DMA_DISABLE);
        hals_uart_interrupt_disable(p_uart->periph, USART_INT_PERR);
        hals_uart_interrupt_disable(p_uart->periph, USART_INT_ERR);
        /* reset rx_state */
        p_uart->rx_state = UART_STATE_FREE;
    } else {
        HAL_DEBUGE("uart processor fatal error: dma error exception due to run state");
    }

    if(p_uart->uart_irq.error_handle != NULL) {
        /* if there is a user error callback */
        p_uart->uart_irq.error_handle(p_uart);
        p_uart->error_state = HAL_UART_ERROR_NONE;
    }
}
